//zadanie 1
//Напишите программу, которая работала бы следующим образом: в prompt вводится значение. С помощью унарного плюса (арифметический оператор) необходимо преобразовать его в число, затем проверить с помощью typeof, принадлежит ли оно к множеству Number.
// Если это число, то вывести в консоль чётное оно или нечётное.
// Если передано не число, выведите: «Упс, кажется, вы ошиблись».
// *NaN, хоть и относится к типу Number, числом не является. Добавьте отдельную проверку для этого значения.
let num;
num=prompt('Введите число');
typeof(+num);

switch (num%2){
    case 1:
        console.log('нечетное');
        break;
    case 0:
        console.log('четное');
        break;
    default:
        alert('Упс, кажется, вы ошиблись')
}